Terraform Plan Output:
```
module.appcd_c6346a43-88b3-5c37-8fe8-a0c30e9b850b.data.aws_caller_identity.current: Reading...
module.appcd_65b99755-8957-522f-9ed4-1242d9ecbad4.aws_cloudwatch_log_group.this: Refreshing state... [id=/aws/lambda/hello-kitty-harsh-function]
module.appcd_c6346a43-88b3-5c37-8fe8-a0c30e9b850b.aws_kms_key.custom_s3_kms_key[0]: Refreshing state... [id=6fc857a1-0425-4f47-bfe3-d54e40457140]
module.appcd_2fc706f9-6176-58c1-862d-78de66dfc1ea.aws_iam_role.this: Refreshing state... [id=hello-kitty-harsh-role]
module.appcd_c6346a43-88b3-5c37-8fe8-a0c30e9b850b.aws_s3_bucket.this: Refreshing state... [id=harsh-anand-19]
module.appcd_c6346a43-88b3-5c37-8fe8-a0c30e9b850b.data.aws_caller_identity.current: Read complete after 0s [id=222634395437]
module.appcd_220481a5-c44d-4db7-9b90-9c1160f1937a.aws_iam_role_policy.this: Refreshing state... [id=hello-kitty-harsh-role:Writer]
module.appcd_477ae9b8-2fbb-5293-b835-eedd87db50b9.aws_lambda_function.this: Refreshing state... [id=hello-kitty-harsh-function]
module.appcd_477ae9b8-2fbb-5293-b835-eedd87db50b9.aws_lambda_function_url.this[0]: Refreshing state... [id=hello-kitty-harsh-function]
module.appcd_c6346a43-88b3-5c37-8fe8-a0c30e9b850b.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=harsh-anand-19]
module.appcd_c6346a43-88b3-5c37-8fe8-a0c30e9b850b.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=harsh-anand-19]
module.appcd_c6346a43-88b3-5c37-8fe8-a0c30e9b850b.aws_kms_alias.a[0]: Refreshing state... [id=alias/s3-harsh-anand-19]
module.appcd_c6346a43-88b3-5c37-8fe8-a0c30e9b850b.aws_s3_bucket_public_access_block.this: Refreshing state... [id=harsh-anand-19]
module.appcd_e65da2f9-bc25-43a9-89b0-7838ca60f2af.aws_iam_role_policy.this: Refreshing state... [id=hello-kitty-harsh-role:aws_s3-hello-kitty-harsh-policy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.appcd_220481a5-c44d-4db7-9b90-9c1160f1937a.aws_iam_role_policy.this must be replaced
-/+ resource "aws_iam_role_policy" "this" {
      ~ id          = "hello-kitty-harsh-role:Writer" -> (known after apply)
        name        = "Writer"
      + name_prefix = (known after apply)
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-harsh-function",
                        ]
                      - Sid      = "CloudWatchLogGroup65b997558957522f9ed41242d9ecbad40"
                    },
                  - {
                      - Action   = [
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-harsh-function:*",
                        ]
                      - Sid      = "CloudWatchLogGroup65b997558957522f9ed41242d9ecbad41"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ role        = "hello-kitty-harsh-role" -> "hello-kitty-harsh-anand-19-role" # forces replacement
    }

  # module.appcd_2fc706f9-6176-58c1-862d-78de66dfc1ea.aws_iam_role.this must be replaced
-/+ resource "aws_iam_role" "this" {
      ~ arn                   = "arn:aws:iam::222634395437:role/hello-kitty-harsh-role" -> (known after apply)
      ~ create_date           = "2024-09-28T09:51:22Z" -> (known after apply)
      ~ id                    = "hello-kitty-harsh-role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "hello-kitty-harsh-role" -> "hello-kitty-harsh-anand-19-role" # forces replacement
      + name_prefix           = (known after apply)
        tags                  = {
            "appstack"  = "hello-kitty-harsh"
            "component" = "hello-kitty-harsh"
        }
      ~ unique_id             = "AROATHVQLI4WZX7P455WB" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ inline_policy (known after apply)
      - inline_policy {
          - name   = "Writer" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-harsh-function",
                            ]
                          - Sid      = "CloudWatchLogGroup65b997558957522f9ed41242d9ecbad40"
                        },
                      - {
                          - Action   = [
                              - "logs:CreateLogStream",
                              - "logs:PutLogEvents",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-harsh-function:*",
                            ]
                          - Sid      = "CloudWatchLogGroup65b997558957522f9ed41242d9ecbad41"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "aws_s3-hello-kitty-harsh-policy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "kms:Decrypt",
                              - "kms:Encrypt",
                              - "kms:GenerateDataKey",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:kms:us-west-2:222634395437:key/6fc857a1-0425-4f47-bfe3-d54e40457140",
                            ]
                          - Sid      = "AllowKmsAccess"
                        },
                      - {
                          - Action   = [
                              - "s3:PutObject",
                              - "s3:ListBucket",
                              - "s3:GetObject",
                              - "s3:GetObjectVersion",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:s3:::harsh-anand-19",
                              - "arn:aws:s3:::harsh-anand-19/*",
                            ]
                          - Sid      = "hellokittyharshIMAGESBUCKETS3Bucketc6346a4388b35c378fe8a0c30e9b850b"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.appcd_477ae9b8-2fbb-5293-b835-eedd87db50b9.aws_lambda_function.this must be replaced
-/+ resource "aws_lambda_function" "this" {
      ~ arn                            = "arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-harsh-function" -> (known after apply)
      ~ code_sha256                    = "ThpXeTZobED3ATPn7m4pXZIgyOEqiZM/qo5OX/My6zE=" -> (known after apply)
      ~ function_name                  = "hello-kitty-harsh-function" -> "hello-kitty-harsh-anand-19-function" # forces replacement
      ~ id                             = "hello-kitty-harsh-function" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-harsh-function/invocations" -> (known after apply)
      ~ last_modified                  = "2024-09-28T09:51:31.861+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-harsh-function:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-harsh-function:$LATEST/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::222634395437:role/hello-kitty-harsh-role" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      ~ source_code_size               = 2168 -> (known after apply)
        tags                           = {
            "appstack"  = "hello-kitty-harsh"
            "component" = "hello-kitty-harsh"
        }
      ~ version                        = "$LATEST" -> (known after apply)
        # (16 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "IMAGES_BUCKET" = "harsh" -> "harsh-anand-19"
            }
        }

      ~ ephemeral_storage (known after apply)
      - ephemeral_storage {
          - size = 512 -> null
        }

      ~ logging_config (known after apply)
      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/hello-kitty-harsh-function" -> null
            # (2 unchanged attributes hidden)
        }

      ~ tracing_config (known after apply)
      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.appcd_477ae9b8-2fbb-5293-b835-eedd87db50b9.aws_lambda_function_url.this[0] must be replaced
-/+ resource "aws_lambda_function_url" "this" {
      ~ function_arn       = "arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-harsh-function" -> (known after apply)
      ~ function_name      = "hello-kitty-harsh-function" -> "hello-kitty-harsh-anand-19-function" # forces replacement
      ~ function_url       = "https://cvq4ocuafnpogwebuuhnacidey0ithls.lambda-url.us-west-2.on.aws/" -> (known after apply)
      ~ id                 = "hello-kitty-harsh-function" -> (known after apply)
      ~ url_id             = "cvq4ocuafnpogwebuuhnacidey0ithls" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.appcd_65b99755-8957-522f-9ed4-1242d9ecbad4.aws_cloudwatch_log_group.this must be replaced
-/+ resource "aws_cloudwatch_log_group" "this" {
      ~ arn               = "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-harsh-function" -> (known after apply)
      ~ id                = "/aws/lambda/hello-kitty-harsh-function" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/lambda/hello-kitty-harsh-function" -> "/aws/lambda/hello-kitty-harsh-anand-19-function" # forces replacement
      + name_prefix       = (known after apply)
        tags              = {
            "appstack"  = "hello-kitty-harsh"
            "component" = "hello-kitty-harsh"
        }
        # (4 unchanged attributes hidden)
    }

  # module.appcd_e65da2f9-bc25-43a9-89b0-7838ca60f2af.aws_iam_role_policy.this must be replaced
-/+ resource "aws_iam_role_policy" "this" {
      ~ id          = "hello-kitty-harsh-role:aws_s3-hello-kitty-harsh-policy" -> (known after apply)
        name        = "aws_s3-hello-kitty-harsh-policy"
      + name_prefix = (known after apply)
      ~ role        = "hello-kitty-harsh-role" -> "hello-kitty-harsh-anand-19-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 6 to add, 0 to change, 6 to destroy.

Changes to Outputs:
  + aws_cloudwatch_log_group_aws_lambda_hello_kitty_harsh_anand_19_function_arn  = (known after apply)
  + aws_cloudwatch_log_group_aws_lambda_hello_kitty_harsh_anand_19_function_name = "/aws/lambda/hello-kitty-harsh-anand-19-function"
  - aws_cloudwatch_log_group_aws_lambda_hello_kitty_harsh_function_arn           = "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-harsh-function" -> null
  - aws_cloudwatch_log_group_aws_lambda_hello_kitty_harsh_function_name          = "/aws/lambda/hello-kitty-harsh-function" -> null
  + aws_iam_role_hello_kitty_harsh_anand_19_role_arn                             = (known after apply)
  + aws_iam_role_hello_kitty_harsh_anand_19_role_name                            = "hello-kitty-harsh-anand-19-role"
  - aws_iam_role_hello_kitty_harsh_role_arn                                      = "arn:aws:iam::222634395437:role/hello-kitty-harsh-role" -> null
  - aws_iam_role_hello_kitty_harsh_role_name                                     = "hello-kitty-harsh-role" -> null
  + aws_lambda_hello_kitty_harsh_anand_19_function_function_arn                  = (known after apply)
  + aws_lambda_hello_kitty_harsh_anand_19_function_function_name                 = "hello-kitty-harsh-anand-19-function"
  + aws_lambda_hello_kitty_harsh_anand_19_function_function_url                  = (known after apply)
  + aws_lambda_hello_kitty_harsh_anand_19_function_invoke_arn                    = (known after apply)
  - aws_lambda_hello_kitty_harsh_function_function_arn                           = "arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-harsh-function" -> null
  - aws_lambda_hello_kitty_harsh_function_function_name                          = "hello-kitty-harsh-function" -> null
  - aws_lambda_hello_kitty_harsh_function_function_url                           = "https://cvq4ocuafnpogwebuuhnacidey0ithls.lambda-url.us-west-2.on.aws/" -> null
  - aws_lambda_hello_kitty_harsh_function_invoke_arn                             = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-harsh-function/invocations" -> null

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```